blog/2019/10/aws-ecs-events-target-input/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-25 Mon 23:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AWS ECS Container Overrides for Events Targets</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Override commands for ECS tasks when using Event Rules"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">AWS ECS Container Overrides for Events Targets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge9de764">Problem</a></li>
<li><a href="#org3655c1b">Exploring the Problem</a></li>
<li><a href="#orge9918bb">Solution</a></li>
<li><a href="#orgc067050">Conclusion</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Using <a href="https://aws.amazon.com/cloudformation/">AWS CloudFormation</a> to configure <a href="https://docs.aws.amazon.com/AmazonCloudWatch/latest/events/WhatIsCloudWatchEvents.html">AWS CloudWatch Events</a> to target <a href="https://aws.amazon.com/ecs/">ECS</a> is
not as well documented as it should be.  Here, we walk-through a highly
specific use case where the documentation was not here to help, how the
solution was found, and possibly some insight when facing similar issues in the
future.
</p>

<p>
In a previous <a href="https://kennyballou.com/blog/2017/10/conky-maildirs-config">post</a>, I made the fecicious call out to use the source.
</p>

</div>

<blockquote>
<p>
When the documentation fails you, use the source.
</p>
</blockquote>

<p>
What to do when there isn't source (code) available?
</p>

<div id="outline-container-orge9de764" class="outline-2">
<h2 id="orge9de764">Problem</h2>
<div class="outline-text-2" id="text-orge9de764">
<p>
While attempting to make some infrastucture changes, I wanted to create a
scheduled <a href="https://docs.aws.amazon.com/AmazonCloudWatch/latest/events/WhatIsCloudWatchEvents.html">event</a> to target a specific
<a href="https://aws.amazon.com/ecs/">task</a>.  However, I needed to be able to override the command
arguments sent to the <a href="https://aws.amazon.com/ecs/">task</a> for specific instances of the schedule.
I started with the <a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-resource-events-rule.html">Events Rule Cloudformation
Documentation</a>.  Following from there, I dug into the
<a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-events-rule-target.html">targets</a> documentation.  Thus far, I might have the
following JSON for my <a href="https://aws.amazon.com/cloudformation/">CloudFormation</a> template:
</p>

<div class="org-src-container">
<pre class="src src-json">"ScheduledEvent": {
    "Type": "AWS::Events::Rule",
    "Properties": {
        "Description": "Scheduled Event that happens periodically",
        "Name": {"Fn::Sub": "${Name}-${AWS::Region}-ScheduledEvent"},
        "ScheduleExpression": "rate(15 minutes)",
        "Targets": [
            {
                "Arn": {"Fn::Sub": "arn:aws:ecs:${AWS::Region}:${AWS::AccountId}:cluster/${ECSCluster}"},
                "Id": {"Fn::Sub": "${Name}-Scheduled-Events"},
                "RoleArn": {"Fn::GetAtt": ["SchedulerEventsRole", "Arn"]},
                "EcsParameters": {
                    "TaskCount": 1,
                    "TaskDefinitionArn": {"Ref": "TaskDefinition"},
                }
            }
        ]
    }
}
</pre>
</div>

<p>
However, what variable is used to override the command parameters of the task?
The documentation has a few keys that might be useful for this prupose.
<a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-events-rule-target.html#cfn-events-rule-target-ecsparameters"><code>EcsParameters</code></a> seems the most promising
from the beginning but this key is more for informing the
<a href="https://docs.aws.amazon.com/AmazonCloudWatch/latest/events/WhatIsCloudWatchEvents.html">Events Rule</a> how to target the <a href="https://aws.amazon.com/ecs/">ECS Task</a>.
<a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-events-rule-target.html#cfn-events-rule-target-runcommandparameters"><code>RunCommandParameters</code></a> also seems
promissing, however, this is for <a href="https://aws.amazon.com/ec2/">EC2</a> targets.  Finally,
<a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-events-rule-target.html#cfn-events-rule-target-input"><code>Input</code></a> seems to be the last available option that
seems generic enough to fit the needs.
</p>

<blockquote>
<p>
Valid JSON text passed to the target.  If you use this property, nothing from
the event text itself is passed to the target.
</p>
</blockquote>

<p>
This is particularly vague.  I suppose we can insert some "text" and see what
happens.
</p>
</div>
</div>

<div id="outline-container-org3655c1b" class="outline-2">
<h2 id="org3655c1b">Exploring the Problem</h2>
<div class="outline-text-2" id="text-org3655c1b">
<blockquote>
<p>
Otherwising shooting in the dark&#x2026;
</p>
</blockquote>

<p>
Focusing in on the <code>Input</code> key, I first tried the following:
</p>

<div class="org-src-container">
<pre class="src src-json">"Input": "command overrides go here",
</pre>
</div>

<p>
However, this failed in <a href="https://aws.amazon.com/cloudformation/">CloudFormation</a> with the
follwing message:
</p>

<pre class="example">
JSON syntax error in input for target ...
</pre>

<p>
Obivously plain strings are not compatiable JSON.
</p>

<p>
Let's try an "object" instead:
</p>

<div class="org-src-container">
<pre class="src src-json">"Input": "{\"command\": \"command overrides go here\"}",
</pre>
</div>

<p>
<a href="https://aws.amazon.com/cloudformation/">CloudFormation</a> accepted this construction.  However,
nothing seemed to work the way expected.  At first, I was curious how even the
body of the "Input" key was being passed along to the task.  From the task
side, printing the standard input and the arguments yielded nothing.  Examining
the target from the <a href="https://docs.aws.amazon.com/AmazonCloudWatch/latest/events/WhatIsCloudWatchEvents.html">Events console</a> didn't seem to
shed any light on the issue, everything looked fine.  Of note, however, is that
there was no mention of the "Input" or override variables available from this
screen.
</p>

<p>
Next, I looked into the <a href="https://aws.amazon.com/ecs/">ECS console</a> examining the scheduled tasks
for the cluster, I could see the task.  Examinging the task showed an error
stating the "command" key was invalid in this context.
</p>

<p>
Finally, I gave up and used the console to edit the target and the "Input" key.
Doing so yielded the JSON structure I was needing to override for the task at
hand.
</p>

<div class="org-src-container">
<pre class="src src-json">{
    "containerOverrides": [
        {
            "name": "container name",
            "command": [
                "command overrides go here"
            ]
        }
    ]
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9918bb" class="outline-2">
<h2 id="orge9918bb">Solution</h2>
<div class="outline-text-2" id="text-orge9918bb">
<p>
However, the "Input" key is a string encoded JSON structure, so the full
solution is the following snippet:
</p>

<div class="org-src-container">
<pre class="src src-json">"ScheduledEvent": {
    "Type": "AWS::Events::Rule",
    "Properties": {
        "Description": "Scheduled Event that happens periodically",
        "Name": {"Fn::Sub": "${Name}-${AWS::Region}-ScheduledEvent"},
        "ScheduleExpression": "rate(15 minutes)",
        "Targets": [
            {
                "Arn": {"Fn::Sub": "arn:aws:ecs:${AWS::Region}:${AWS::AccountId}:cluster/${ECSCluster}"},
                "Id": {"Fn::Sub": "${Name}-Scheduled-Events"},
                "Input": "{\"containerOverrides\": [{\"name\": \"container name\", \"command\": [\"command overrides go here!\"]}]}",
                "RoleArn": {"Fn::GetAtt": ["SchedulerEventsRole", "Arn"]},
                "EcsParameters": {
                    "TaskCount": 1,
                    "TaskDefinitionArn": {"Ref": "TaskDefinition"},
                }
            }
        ]
    }
}
</pre>
</div>

<p>
This structure may seem familiar.  This structure is documented in the
<a href="https://docs.aws.amazon.com/AmazonECS/latest/APIReference/API_ContainerOverride.html">AWS API documentation</a>, which is referenced in the
<a href="https://docs.aws.amazon.com/AmazonECS/latest/APIReference/API_RunTask.html">ECS RunTask API</a> documentation.
</p>
</div>
</div>

<div id="outline-container-orgc067050" class="outline-2">
<h2 id="orgc067050">Conclusion</h2>
<div class="outline-text-2" id="text-orgc067050">
<p>
The connection between "Input" is a JSON encoded string and pass the
"containerOverrides" structure is missing or not obvious at best.  Hopefully,
this simple example helps guide others to the right solution.  If nothing else,
it will remind me that when a variable is particularly vague about its usage,
it might help to examine the <a href="https://docs.aws.amazon.com/index.html">AWS API documentation</a> more closely.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2023 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
